taste_buds_api/app/controllers/api/v1/recipes_controller.rb

    def index
        recipes = Recipe.order(id: :desc)
---
SELECT "recipes".* FROM "recipes" ORDER BY "recipes"."id" DESC

    def create
        recipe = Recipe.new recipe_params
        recipe.user = current_user

        if recipe.save
---
INSERT INTO "recipes" ("title", "story", "instructions", "serving_size", "spicy", "sweet", "salty", "image_url", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

    def destroy
        if @recipt || @recipe.destroy
---
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 18]]

    def find_recipe
        @recipe = Recipe.find params[:id]
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]